package prepare;

public class Prepare4 {
	  public static void main(String[] args) {
//	      3. 사용자로부터 한 개의 숫자를 입력받아, 
//	      홀수인지 짝수인지 판별하고 결과를 화면에 출력하는 프로그램의 로직으로 틀린 것을 고르시오.
//	      ① 사용자에게 입력 받기 위한 Scanner를 import하여 선언한다.
//	      ② Scanner의 메소드인 .nextInt()라는 메소드를 사용하여 값을 입력 받고 String 타입의 변수에 값을 할당한다.
//	      ③ 분기 처리를 위해 조건문 if~else문을 사용한다.
//	      ④ 판별 결과를 화면에 출력한다.
//		  답은 2
		  
//	      6. 다음 다형성(Polymorphism)의 주요 특징으로 알맞는 것을 고르시오.
//	      ① 다형성은 클래스를 여러 개 만드는 것을 다형성이라고 한다.
//	      ② 클래스의 필드에 생성된 클래스와 이름이 같은 메소드를 함수라고 하여 리턴 값을 리턴 할 수 있다. 생성자라고!!!!!
//	      ③ 다형성은 객체지향 언어(JAVA 등)에서는 사용되지 않으며 스크립트 언어에서 주로 활용된다.
//	      ④ 클래스 필드 선언 시 동일한 이름의 메소드나 생성자를 매개변수의 타입, 순서, 개수를 다르게 하여 사용할 수 있는 것을 오버로딩이라고 한다.
//		  답은 4
		  
//	      1. 구조적 프로그래밍은 구조화된 조직 체계의 모양처럼 하나의 프로그램이 구조를 갖도록 만들어 나가는 프로그래밍 방법을 의미한다. 
//	      다음 중 구조적 프로그래밍에 해당하지 않는 것을 고르시오.
//	      ① 절차식 언어 ②명령어 언어 ③ 함수 중심 언어 ④ 객체 지향 언어
//		  답은 4

//	      2. 객체 지향 프로그래밍 언어의 구성요소에 해당하지 않는 것을 고르시오.
//	      ① 필드(변수) ② 생성자 ③ 메소드 ④ 프로시저

//	      7. 다음 중 대표적인 스크립트 언어가 아닌 것을 고르시오.
//	      ① JavaScript
//	      ② JQuery
//	      ③ JAVA
//	      ④ PHP
//		  답은 3
		  
	   }
}
